<?php

return [
    'store' => [
        'success' => 'Запись успешно добавлена',
        'fail' => 'Не удалось добавить запись',
    ],
    'update' => [
        'success' => 'Изменения успешно сохранены',
        'fail' => 'Не удалось применить изменения',
    ],
    'destroy' => [
        'success' => 'Запись успешно удалена',
        'fail' => 'Не удалось удалить запись',
    ],
    'restore' => [
        'success' => 'Запись успешно восстановлена',
        'fail' => 'Не удалось восстановить запись',
    ],
];
