<?php

return [
    'store' => [
        'success' => 'Запись успешно добавлена',
        'fail' => 'Не удалось добавить запись',
    ],
    'update' => [
        'success' => 'Изменения успешно сохранены',
        'fail' => 'Не удалось применить изменения',
    ],
    'destroy' => [
        'success' => 'Запись успешно удалена',
        'fail' => 'Не удалось удалить запись',
    ],
    'restore' => [
        'success' => 'Запись успешно восстановлена',
        'fail' => 'Не удалось восстановить запись',
    ],
    'attachAggregationType' => [
        'success' => 'Тип агрегации успешно добавлен',
        'fail' => 'Не удалось добавить тип агрегации',
    ],
    'detachAggregationType' => [
        'success' => 'Тип агрегации успешно удален',
        'fail' => 'Не удалось удалить тип агрегации',
    ],
    'updateAggregationTypeProductQuantity' => [
        'success' => 'Количество продукции в типе агрегации успешно обновлено',
        'fail' => 'Не удалось обновить количество продукции',
    ],
    'detachMaterial' => [
        'success' => 'Комплектующее успешно удалено из состава продукта',
        'fail' => 'Не удалось удалить комплектующее',
    ],
    'attachMaterial' => [
        'success' => 'Комплектующее успещно добавлено в состав продукта',
        'fail' => 'Не удалось добавить комлпектующее',
    ],
];
