<?php

return [
    'entries' => [
        'entries' => 'Записи',
        'all' => 'Все',
        'of' => 'из',
        'no' => 'Нет записей',
        'no_to_find' => 'Не удалось найти записи',
        'show' => 'Показать',
        'working' => 'Рабочие',
        'trashed' => 'Удаленные'
    ],
    'buttons' => [
        'hide' => 'Скрыть',
        'save_as' => 'Сохранить как',
        'delete' => 'Удалить',
        'edit' => 'Редактировать',
        'restore' => 'Восстановить'
    ],
    'search' => 'Поиск',
    'wait' => 'Пожалуйста, подождите'
];
