<?php

return [
    'entries' => [
        'all' => 'Все',
        'entries' => 'Записи',
        'no' => 'Нет записей',
        'no_to_find' => 'Не удалось найти записи',
        'of' => 'из',
        'show' => 'Показать',
        'trashed' => 'Удаленные',
        'working' => 'Рабочие',
    ],
    'buttons' => [
        'delete' => 'Удалить',
        'edit' => 'Редактировать',
        'hide' => 'Скрыть',
        'restore' => 'Восстановить',
        'save_as' => 'Сохранить как',
        'copy' => 'Копировать',
    ],
    'filter' => 'Фильтр',
    'interval' => 'Интервал',
    'search' => 'Поиск',
    'wait' => 'Пожалуйста, подождите',
];
