<?php

return [
    'button' => [
        'save' => 'Сохранить',
        'add' => 'Добавить',
        'hide' => 'Скрыть',
        'show' => 'Показать',
        'open' => 'Открыть',
        'print' => 'Печать',
        'back' => 'Назад',
        'create' => 'Создать',
        'statistic' => 'Статистика',
        'download' => 'Скачать',
    ],
    'titles' => [
        'add' => 'Добавить',
        'list' => 'Список'
    ],
    'modal' => [
        'close' => 'Закрыть',
        'delete' => 'Вы действительно хотите удалить запись?',
        'restore' => 'Вы действительно хотите восстановить запись?',
    ],
    'collapse' => 'Развернуть/Свернуть',
    'last_updated' => 'Последнее обновление',
    'zoom' => 'Масштаб',
    'yes' => 'Да',
    'no' => 'Нет',
];
