<?php

return [
    'actions' => [
        'action' => 'Действие',
        'create' => 'Создание',
        'destroy' => 'Удаление',
        'restore' => 'Восстановление',
        'update' => 'Обновление',
        'attach' => 'Прикрепление',
        'detach' => 'Открепление',
    ],

    'after' => 'После',
    'before' => 'До',
    'changes' => 'Изменения',
    'fail' => 'Не удалось применить фильтр',
    'primary_key' => 'Значение ключа',
    'log' => 'Лог',
    'logs' => 'Логи',
    'model' => 'Модель',
    'table' => 'Таблица',
    'time' => 'Время',
];
