<?php

return [
    'action' => [
        'register' => [
            'success' => 'Пользователь :name успешно зарегистрирован',
            'fail' => 'Не удалось зарегистрировать пользователя :name'
        ],
        'update' => [
            'success' => 'Пользователь :name успешно обновлен',
            'fail' => 'Не удалось обновить пользователя :name'
        ],
        'destroy' => 'Пользователь :name успешно удален',
        'restore' => 'Пользователь :name успешно восстановлен',
        'edit' => 'Редактирование пользователя :name'
    ],
    'users' => 'Пользователи',
    'user' => 'Пользователь',
    'name' => 'ФИО',
    'verified' => 'Подтвержден',
    'registration_date' => 'Дата регистрации',
];
